Revit 2024 API
IFCExtrusionCreationData.ClearOpenings Method
 Removes all cached openings from the data.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void ClearOpenings()
Visual Basic
Public Sub ClearOpenings
Visual C++
public:
void ClearOpenings()
See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace